99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/websocket/esp32_mquickjs_websocket.c
#include "esp32_mquickjs_websocket.h"
#include "esp32_mquickjs_memory.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_WEBSOCKET

#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_event_queue.h"
#include "esp32_mquickjs_event_queue_drain.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_net.h"
#include "esp32_mquickjs_native_pool.h"
#include "esp32_mquickjs_options.h"
#include "esp32_mquickjs_websocket_client_resources.h"
#include "utils/esp32_mquickjs_byte_source.h"
#include "utils/esp32_mquickjs_tls_error.h"

#include <stdatomic.h>
#include <stdio.h>
#include <string.h>

#include "esp_heap_caps.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "esp_websocket_client.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/task.h"

#define WEBSOCKET_URL_MAX_LEN 512U
#define WEBSOCKET_AUTHORIZATION_MAX_LEN 512U
#define WEBSOCKET_SUBPROTOCOL_MAX_LEN 128U
#define WEBSOCKET_ERROR_TEXT_LEN 160U
#define WEBSOCKET_DEFAULT_NETWORK_TIMEOUT_MS 10000
#define WEBSOCKET_DEFAULT_SEND_TIMEOUT_MS 1000
#define WEBSOCKET_DEFAULT_PING_INTERVAL_SEC 10
#define WEBSOCKET_OPCODE_TEXT 0x1
#define WEBSOCKET_OPCODE_BINARY 0x2
#define WEBSOCKET_OPCODE_CLOSE 0x8
#define WEBSOCKET_OPCODE_PING 0x9
#define WEBSOCKET_OPCODE_PONG 0xA
#define WEBSOCKET_INVALID_SLOT UINT16_MAX

typedef enum {
    WEBSOCKET_CALLBACK_OPEN = 1,
    WEBSOCKET_CALLBACK_MESSAGE,
    WEBSOCKET_CALLBACK_CLOSE,
    WEBSOCKET_CALLBACK_ERROR,
} esp32_mquickjs_websocket_callback_kind_t;

typedef enum {
    WEBSOCKET_LIFECYCLE_IDLE = 0,
    WEBSOCKET_LIFECYCLE_OPEN,
    WEBSOCKET_LIFECYCLE_CONNECTED,
    WEBSOCKET_LIFECYCLE_CLOSING,
} esp32_mquickjs_websocket_lifecycle_t;

typedef struct {
    esp32_mquickjs_websocket_callback_kind_t kind;
    uint32_t generation;
    char *data;
    size_t data_len;
    uint16_t slot_index;
    uint32_t sequence;
    int64_t timestamp_us;
    int32_t code;
    bool binary;
    char message[WEBSOCKET_ERROR_TEXT_LEN];
} esp32_mquickjs_websocket_callback_event_t;

typedef struct {
    uint32_t generation;
} esp32_mquickjs_websocket_ref_t;

typedef struct {
    bool initialized;
    _Atomic esp32_mquickjs_websocket_lifecycle_t lifecycle;
    uint32_t generation;
    esp32_mquickjs_runtime_t *runtime;
    esp32_mquickjs_event_queue_t *event_queue;
    QueueHandle_t queue;
    esp_websocket_client_handle_t client;
    bool client_started;
    bool events_registered;
    size_t max_message_bytes;
    uint32_t send_timeout_ms;
    esp32_mquickjs_native_pool_t receive_free;
    uint8_t *receive_payloads;
    size_t receive_stride;
    uint16_t receive_capacity;
    char *fragment;
    uint16_t fragment_slot_index;
    size_t fragment_len;
    size_t fragment_expected;
    bool fragment_binary;
    bool fragment_dropping;
    uint32_t opened_events;
    uint32_t received_messages;
    uint32_t sent_messages;
    _Atomic uint32_t dropped_events;
    _Atomic uint32_t oversized_messages;
    _Atomic uint32_t event_sequence;
    _Atomic uint32_t callbacks_active;
    _Atomic bool close_worker_completed;
    _Atomic int close_worker_result;
    bool sending;
    bool close_pending;
    bool close_worker_submitted;
} esp32_mquickjs_websocket_state_t;

static esp32_mquickjs_websocket_state_t s_websocket_state;
static esp32_mquickjs_websocket_ref_t s_websocket_closed_ref;

static const char *TAG = "esp32qjs_websocket";

static bool websocket_poller(JSContext *ctx,
                             esp32_mquickjs_runtime_t *runtime,
                             void *opaque);
static void websocket_event_handler(void *handler_args,
                                    esp_event_base_t base,
                                    int32_t event_id,
                                    void *event_data);
static bool websocket_register_future_driver(
    JSContext *ctx,
    esp32_mquickjs_runtime_t *runtime);

static bool websocket_lifecycle_is_active(
    esp32_mquickjs_websocket_lifecycle_t lifecycle)
{
    return lifecycle == WEBSOCKET_LIFECYCLE_OPEN ||
           lifecycle == WEBSOCKET_LIFECYCLE_CONNECTED;
}

static void websocket_reset_state(void)
{
    memset(&s_websocket_state, 0, sizeof(s_websocket_state));
    atomic_init(&s_websocket_state.lifecycle, WEBSOCKET_LIFECYCLE_IDLE);
    atomic_init(&s_websocket_state.dropped_events, 0);
    atomic_init(&s_websocket_state.oversized_messages, 0);
    atomic_init(&s_websocket_state.event_sequence, 0);
    atomic_init(&s_websocket_state.callbacks_active, 0);
    atomic_init(&s_websocket_state.close_worker_completed, false);
    atomic_init(&s_websocket_state.close_worker_result, ESP_OK);
    s_websocket_state.fragment_slot_index = WEBSOCKET_INVALID_SLOT;
}

static bool websocket_callback_begin(uint32_t *generation)
{
    esp32_mquickjs_websocket_lifecycle_t lifecycle =
        atomic_load_explicit(&s_websocket_state.lifecycle,
                             memory_order_acquire);

    if (generation == NULL || !websocket_lifecycle_is_active(lifecycle)) {
        return false;
    }
    /* The release-store that opened this generation publishes all immutable
     * callback inputs, including queue, runtime, limits, and generation. */
    *generation = s_websocket_state.generation;
    return true;
}

static bool websocket_generation_is_active(uint32_t generation)
{
    esp32_mquickjs_websocket_lifecycle_t lifecycle =
        atomic_load_explicit(&s_websocket_state.lifecycle,
                             memory_order_acquire);

    return websocket_lifecycle_is_active(lifecycle) &&
           generation == s_websocket_state.generation;
}

static bool websocket_callback_set_connected(uint32_t generation,
                                             bool connected,
                                             bool *changed)
{
    esp32_mquickjs_websocket_lifecycle_t current =
        atomic_load_explicit(&s_websocket_state.lifecycle,
                             memory_order_acquire);
    esp32_mquickjs_websocket_lifecycle_t desired =
        connected ? WEBSOCKET_LIFECYCLE_CONNECTED
                  : WEBSOCKET_LIFECYCLE_OPEN;

    if (changed != NULL) {
        *changed = false;
    }
    while (websocket_lifecycle_is_active(current) &&
           generation == s_websocket_state.generation) {
        if (current == desired) {
            return true;
        }
        if (atomic_compare_exchange_weak_explicit(
                &s_websocket_state.lifecycle, &current, desired,
                memory_order_acq_rel, memory_order_acquire)) {
            if (changed != NULL) {
                *changed = true;
            }
            return true;
        }
    }
    return false;
}

static void websocket_release_receive_slot(uint16_t slot_index)
{
    if (slot_index != WEBSOCKET_INVALID_SLOT &&
        slot_index < s_websocket_state.receive_capacity) {
        (void)esp32_mquickjs_native_pool_release(
            &s_websocket_state.receive_free, slot_index);
    }
}

