99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/websocket/esp32_mquickjs_websocket.c
static void websocket_free_callback_event(
    esp32_mquickjs_websocket_callback_event_t *event)
{
    if (event == NULL) {
        return;
    }
    if (event->slot_index != WEBSOCKET_INVALID_SLOT) {
        websocket_release_receive_slot(event->slot_index);
        event->slot_index = WEBSOCKET_INVALID_SLOT;
    } else {
        heap_caps_free(event->data);
    }
    event->data = NULL;
}

static void websocket_drain_queue(void)
{
    esp32_mquickjs_websocket_callback_event_t event;

    if (s_websocket_state.queue == NULL) {
        return;
    }
    while (xQueueReceive(s_websocket_state.queue, &event, 0) == pdTRUE) {
        websocket_free_callback_event(&event);
    }
}

static bool websocket_allocate_receive_pool(
    JSContext *ctx,
    size_t max_message_bytes)
{
    size_t capacity = CONFIG_ESP32_MQUICKJS_WEBSOCKET_EVENT_QUEUE_LEN;
    size_t stride = max_message_bytes + 1U;

    if (capacity == 0U || capacity > UINT16_MAX ||
        stride == 0U || capacity > SIZE_MAX / stride) {
        JS_ThrowRangeError(ctx, "invalid WebSocket receive pool size");
        return false;
    }
    s_websocket_state.receive_payloads =
        esp32_mquickjs_memory_payload_alloc(
            capacity * stride, ESP32_MQUICKJS_MEMORY_EXTERNAL);
    if (s_websocket_state.receive_payloads == NULL ||
        !esp32_mquickjs_native_pool_init(
            &s_websocket_state.receive_free, (uint32_t)capacity)) {
        heap_caps_free(s_websocket_state.receive_payloads);
        s_websocket_state.receive_payloads = NULL;
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    s_websocket_state.receive_capacity = (uint16_t)capacity;
    s_websocket_state.receive_stride = stride;
    s_websocket_state.fragment_slot_index = WEBSOCKET_INVALID_SLOT;
    return true;
}

static void websocket_free_receive_pool(void)
{
    heap_caps_free(s_websocket_state.receive_payloads);
    s_websocket_state.receive_payloads = NULL;
    s_websocket_state.receive_stride = 0;
    s_websocket_state.receive_capacity = 0;
    memset(&s_websocket_state.receive_free, 0,
           sizeof(s_websocket_state.receive_free));
}

static void websocket_reset_fragment(void)
{
    websocket_release_receive_slot(
        s_websocket_state.fragment_slot_index);
    s_websocket_state.fragment = NULL;
    s_websocket_state.fragment_slot_index = WEBSOCKET_INVALID_SLOT;
    s_websocket_state.fragment_len = 0;
    s_websocket_state.fragment_expected = 0;
    s_websocket_state.fragment_binary = false;
    s_websocket_state.fragment_dropping = false;
}

static bool websocket_queue_send(void *destination, const void *event)
{
    return destination != NULL && event != NULL &&
           xQueueSend((QueueHandle_t)destination, event, 0) == pdTRUE;
}

static void websocket_enqueue(esp32_mquickjs_websocket_callback_event_t *event,
                              uint32_t generation)
{
    uint32_t dropped = 0;

    if (event == NULL || s_websocket_state.queue == NULL ||
        !websocket_generation_is_active(generation)) {
        websocket_free_callback_event(event);
        return;
    }
    event->generation = generation;
    event->sequence = atomic_fetch_add_explicit(
                          &s_websocket_state.event_sequence, 1,
                          memory_order_relaxed) +
                      1U;
    event->timestamp_us = esp_timer_get_time();
    if (!esp32_mquickjs_event_queue_enqueue_from_callback(
            s_websocket_state.queue, event, websocket_queue_send,
            &dropped)) {
        atomic_fetch_add_explicit(&s_websocket_state.dropped_events, dropped,
                                  memory_order_relaxed);
        websocket_free_callback_event(event);
        return;
    }
    esp32_mquickjs_notify_activity(s_websocket_state.runtime);
}

static void websocket_enqueue_simple(esp32_mquickjs_websocket_callback_kind_t kind,
                                     int32_t code,
                                     const char *message,
                                     uint32_t generation)
{
    esp32_mquickjs_websocket_callback_event_t event = {
        .kind = kind,
        .code = code,
        .slot_index = WEBSOCKET_INVALID_SLOT,
    };

    if (message != NULL) {
        snprintf(event.message, sizeof(event.message), "%s", message);
    }
    websocket_enqueue(&event, generation);
}

static void websocket_enqueue_error(const char *message, int32_t code,
                                    uint32_t generation)
{
    websocket_enqueue_simple(WEBSOCKET_CALLBACK_ERROR, code, message,
                             generation);
}

static void websocket_handle_data(const esp_websocket_event_data_t *data,
                                  uint32_t generation)
{
    size_t offset;
    size_t chunk_len;
    size_t payload_len;

    if (data == NULL || !websocket_generation_is_active(generation)) {
        return;
    }
    if (data->op_code == WEBSOCKET_OPCODE_CLOSE ||
        data->op_code == WEBSOCKET_OPCODE_PING ||
        data->op_code == WEBSOCKET_OPCODE_PONG) {
        return;
    }
    if (data->payload_offset == 0 &&
        data->op_code != WEBSOCKET_OPCODE_TEXT &&
        data->op_code != WEBSOCKET_OPCODE_BINARY) {
        if (data->payload_offset == 0) {
            websocket_enqueue_error("unsupported WebSocket data opcode",
                                    data->op_code, generation);
        }
        return;
    }

    if (data->payload_offset < 0 || data->data_len < 0 || data->payload_len < 0) {
        websocket_enqueue_error("invalid WebSocket payload bounds", 0,
                                generation);
        websocket_reset_fragment();
        return;
    }
    offset = (size_t)data->payload_offset;
    chunk_len = (size_t)data->data_len;
    payload_len = (size_t)data->payload_len;

    if (offset == 0) {
        websocket_reset_fragment();
        s_websocket_state.fragment_expected = payload_len;
        s_websocket_state.fragment_binary =
            data->op_code == WEBSOCKET_OPCODE_BINARY;
        if (!data->fin || payload_len > s_websocket_state.max_message_bytes) {
            s_websocket_state.fragment_dropping = true;
            if (payload_len > s_websocket_state.max_message_bytes) {
                atomic_fetch_add_explicit(
                    &s_websocket_state.oversized_messages, 1,
                    memory_order_relaxed);
                websocket_enqueue_error(
                    "WebSocket message exceeds configured maxMessageBytes",
                    (int32_t)payload_len, generation);
            } else {
                websocket_enqueue_error(
                    "fragmented WebSocket messages are not supported", 0,
                    generation);
            }
        } else {
            uint16_t slot_index;

            if (!esp32_mquickjs_native_pool_acquire(
                    &s_websocket_state.receive_free, &slot_index)) {
                s_websocket_state.fragment_dropping = true;
                websocket_enqueue_error(
                    "WebSocket receive pool is exhausted", 0,
                    generation);
            } else {
                s_websocket_state.fragment_slot_index = slot_index;
                s_websocket_state.fragment =
                    (char *)(s_websocket_state.receive_payloads +
                             ((size_t)slot_index *
                              s_websocket_state.receive_stride));
            }
        }
    }

    if (s_websocket_state.fragment_dropping) {
        if (offset + chunk_len >= payload_len) {
            websocket_reset_fragment();
        }
        return;
    }
    if (s_websocket_state.fragment == NULL ||
        payload_len != s_websocket_state.fragment_expected ||
        offset != s_websocket_state.fragment_len ||
        offset + chunk_len > payload_len) {
        websocket_enqueue_error("non-contiguous WebSocket payload", 0,
                                generation);
        websocket_reset_fragment();
        return;
    }

