99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/websocket/esp32_mquickjs_websocket.c
    if (chunk_len > 0 && data->data_ptr != NULL) {
        memcpy(s_websocket_state.fragment + offset, data->data_ptr, chunk_len);
    }
    s_websocket_state.fragment_len += chunk_len;
    if (s_websocket_state.fragment_len >= payload_len) {
        esp32_mquickjs_websocket_callback_event_t event = {
            .kind = WEBSOCKET_CALLBACK_MESSAGE,
            .data = s_websocket_state.fragment,
            .data_len = payload_len,
            .binary = s_websocket_state.fragment_binary,
            .slot_index = s_websocket_state.fragment_slot_index,
        };

        if (!event.binary) {
            event.data[event.data_len] = '\0';
        }
        s_websocket_state.fragment = NULL;
        s_websocket_state.fragment_slot_index = WEBSOCKET_INVALID_SLOT;
        s_websocket_state.fragment_len = 0;
        s_websocket_state.fragment_expected = 0;
        websocket_enqueue(&event, generation);
    }
}

static void websocket_event_handler(void *handler_args,
                                    esp_event_base_t base,
                                    int32_t event_id,
                                    void *event_data)
{
    esp_websocket_event_data_t *data = event_data;
    uint32_t generation;
    int32_t code = 0;
    bool changed = false;

    (void)handler_args;
    (void)base;
    atomic_fetch_add_explicit(&s_websocket_state.callbacks_active, 1,
                              memory_order_acq_rel);
    if (!websocket_callback_begin(&generation)) {
        goto done;
    }

    switch (event_id) {
    case WEBSOCKET_EVENT_CONNECTED:
        if (websocket_callback_set_connected(generation, true, &changed) &&
            changed) {
            websocket_enqueue_simple(WEBSOCKET_CALLBACK_OPEN, 0, NULL,
                                     generation);
        }
        break;
    case WEBSOCKET_EVENT_DATA:
        websocket_handle_data(data, generation);
        break;
    case WEBSOCKET_EVENT_DISCONNECTED:
        if (!websocket_callback_set_connected(generation, false, NULL)) {
            break;
        }
        if (data != NULL) {
            code = data->error_handle.esp_ws_handshake_status_code;
        }
        websocket_enqueue_simple(WEBSOCKET_CALLBACK_CLOSE, code,
                                 "disconnected", generation);
        break;
    case WEBSOCKET_EVENT_CLOSED:
        (void)websocket_callback_set_connected(generation, false, NULL);
        break;
    case WEBSOCKET_EVENT_ERROR:
        if (data != NULL) {
            code = data->error_handle.error_type == WEBSOCKET_ERROR_TYPE_TCP_TRANSPORT &&
                           data->error_handle.esp_tls_last_esp_err != ESP_OK
                       ? data->error_handle.esp_tls_last_esp_err
                       : data->error_handle.esp_ws_handshake_status_code;
        }
        websocket_enqueue_error("WebSocket connection error", code,
                                generation);
        break;
    default:
        break;
    }

done:
    atomic_fetch_sub_explicit(&s_websocket_state.callbacks_active, 1,
                              memory_order_release);
}

static int websocket_client_resource_stop(void *client, void *opaque)
{
    (void)opaque;
    return esp_websocket_client_stop(
        (esp_websocket_client_handle_t)client);
}

static int websocket_client_resource_unregister_events(
    void *client, void *opaque)
{
    (void)opaque;
    return esp_websocket_unregister_events(
        (esp_websocket_client_handle_t)client,
        WEBSOCKET_EVENT_ANY,
        websocket_event_handler);
}

static int websocket_client_resource_quiesce(void *client, void *opaque)
{
    (void)client;
    (void)opaque;
    while (atomic_load_explicit(&s_websocket_state.callbacks_active,
                                memory_order_acquire) != 0U) {
        vTaskDelay(1);
    }
    return ESP_OK;
}

static int websocket_client_resource_destroy(void *client, void *opaque)
{
    (void)opaque;
    return esp_websocket_client_destroy(
        (esp_websocket_client_handle_t)client);
}

static const esp32_mquickjs_websocket_client_resource_ops_t
    s_websocket_client_resource_ops = {
        .stop = websocket_client_resource_stop,
        .unregister_events =
            websocket_client_resource_unregister_events,
        .quiesce = websocket_client_resource_quiesce,
        .destroy = websocket_client_resource_destroy,
    };

static esp_err_t websocket_cleanup_client_resources(
    esp32_mquickjs_websocket_state_t *state)
{
    esp32_mquickjs_websocket_client_resources_t resources;
    esp_err_t err;

    if (state == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    resources = (esp32_mquickjs_websocket_client_resources_t){
        .client = state->client,
        .started = state->client_started,
        .events_registered = state->events_registered,
    };
    err = esp32_mquickjs_websocket_client_resources_deinit(
        &resources, &s_websocket_client_resource_ops);
    state->client = (esp_websocket_client_handle_t)resources.client;
    state->client_started = resources.started;
    state->events_registered = resources.events_registered;
    return err;
}

static void websocket_finish_close_source(void)
{
    s_websocket_state.client = NULL;
    s_websocket_state.client_started = false;
    s_websocket_state.events_registered = false;
    websocket_reset_fragment();
    websocket_drain_queue();
    websocket_free_receive_pool();
    s_websocket_state.close_pending = false;
    s_websocket_state.close_worker_submitted = false;
    atomic_store_explicit(&s_websocket_state.close_worker_completed, false,
                          memory_order_release);
    atomic_store_explicit(&s_websocket_state.close_worker_result, ESP_OK,
                          memory_order_release);
    atomic_store_explicit(&s_websocket_state.lifecycle,
                          WEBSOCKET_LIFECYCLE_IDLE,
                          memory_order_release);
}

static void websocket_close_worker(void *opaque)
{
    esp32_mquickjs_websocket_state_t *state = opaque;
    esp_err_t err = ESP_OK;

    if (state != NULL && state->client != NULL) {
        if (state->client_started &&
            esp_websocket_client_is_connected(state->client)) {
            if (esp_websocket_client_close(
                    state->client,
                    pdMS_TO_TICKS(WEBSOCKET_DEFAULT_SEND_TIMEOUT_MS)) ==
                ESP_OK) {
                state->client_started = false;
            }
        }
        err = websocket_cleanup_client_resources(state);
    }
    atomic_store_explicit(&s_websocket_state.close_worker_result, err,
                          memory_order_release);
    atomic_store_explicit(&s_websocket_state.close_worker_completed, true,
                          memory_order_release);
}

static bool websocket_schedule_close_worker(void)
{
    if (s_websocket_state.client == NULL) {
        websocket_finish_close_source();
        return true;
    }
    if (s_websocket_state.close_worker_submitted) {
        return true;
    }
    if (atomic_load_explicit(&s_websocket_state.close_worker_result,
                             memory_order_acquire) != ESP_OK) {
        return false;
    }
    atomic_store_explicit(&s_websocket_state.close_worker_completed, false,
                          memory_order_release);
    if (!esp32_mquickjs_submit_background_worker(
            websocket_close_worker, &s_websocket_state)) {
        atomic_store_explicit(&s_websocket_state.close_worker_result,
                              ESP_ERR_NO_MEM,
                              memory_order_release);
        return false;
    }
    s_websocket_state.close_worker_submitted = true;
    return true;
}

static bool websocket_poll_close(void)
{
    if (atomic_load_explicit(&s_websocket_state.lifecycle,
                             memory_order_acquire) !=
            WEBSOCKET_LIFECYCLE_CLOSING ||
        s_websocket_state.sending) {
        return false;
    }
    if (!s_websocket_state.close_worker_submitted) {
        return websocket_schedule_close_worker();
    }
    if (!atomic_load_explicit(&s_websocket_state.close_worker_completed,
                              memory_order_acquire)) {
        return false;
    }
    s_websocket_state.close_worker_submitted = false;
    atomic_store_explicit(&s_websocket_state.close_worker_completed, false,
                          memory_order_release);
    if (atomic_load_explicit(&s_websocket_state.close_worker_result,
                             memory_order_acquire) != ESP_OK) {
        return false;
    }
    websocket_finish_close_source();
    return true;
}

static void websocket_close_source(void *opaque)
{
    (void)opaque;
    s_websocket_state.event_queue = NULL;
    atomic_store_explicit(&s_websocket_state.close_worker_result, ESP_OK,
                          memory_order_release);
    atomic_store_explicit(&s_websocket_state.lifecycle,
                          WEBSOCKET_LIFECYCLE_CLOSING,
                          memory_order_release);
    if (s_websocket_state.sending) {
        s_websocket_state.close_pending = true;
        return;
    }
    s_websocket_state.close_pending = true;
    (void)websocket_schedule_close_worker();
}

