99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/websocket/esp32_mquickjs_websocket.c
static void websocket_close_internal(void)
{
    esp32_mquickjs_event_queue_t *event_queue = s_websocket_state.event_queue;

    if (event_queue != NULL) {
        (void)esp32_mquickjs_event_queue_close(event_queue);
    } else {
        websocket_close_source(NULL);
    }
}

static bool websocket_wait_for_close(void)
{
    esp32_mquickjs_runtime_t *runtime = s_websocket_state.runtime;
    esp32_mquickjs_native_wait_t wait;

    esp32_mquickjs_native_wait_begin(runtime, &wait);
    while (atomic_load_explicit(&s_websocket_state.lifecycle,
                                memory_order_acquire) ==
           WEBSOCKET_LIFECYCLE_CLOSING) {
        if (websocket_poll_close()) {
            continue;
        }
        if (!s_websocket_state.close_worker_submitted &&
            atomic_load_explicit(&s_websocket_state.close_worker_result,
                                 memory_order_acquire) != ESP_OK) {
            esp32_mquickjs_native_wait_end(runtime, &wait);
            return false;
        }
        (void)esp32_mquickjs_cooperate(runtime);
        (void)esp32_mquickjs_future_cooperate(runtime);
        vTaskDelay(pdMS_TO_TICKS(10));
    }
    esp32_mquickjs_native_wait_end(runtime, &wait);
    return true;
}

static bool websocket_make_event_object(
    JSContext *ctx,
    esp32_mquickjs_websocket_callback_event_t *event,
    JSValue *out_event)
{
    JSGCRef object_ref;
    JSGCRef data_ref;
    JSValue *object;
    JSValue *data;
    const char *type;

    switch (event->kind) {
    case WEBSOCKET_CALLBACK_OPEN:
        type = "open";
        break;
    case WEBSOCKET_CALLBACK_MESSAGE:
        type = "message";
        break;
    case WEBSOCKET_CALLBACK_CLOSE:
        type = "close";
        break;
    case WEBSOCKET_CALLBACK_ERROR:
    default:
        type = "error";
        break;
    }

    object = JS_PushGCRef(ctx, &object_ref);
    data = JS_PushGCRef(ctx, &data_ref);
    *data = JS_UNDEFINED;
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "type",
                                         JS_NewString(ctx, type)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "sequence",
                                         JS_NewUint32(ctx, event->sequence)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "timestampUs",
                                         JS_NewInt64(ctx, event->timestamp_us))) {
        JS_PopGCRef(ctx, &data_ref);
        JS_PopGCRef(ctx, &object_ref);
        return false;
    }
    if (event->kind == WEBSOCKET_CALLBACK_MESSAGE) {
        *data = event->binary
                    ? esp32_mquickjs_new_owned_byte_view(
                          ctx, (uint8_t *)event->data, event->data_len)
                    : JS_NewStringLen(ctx, event->data, event->data_len);
        if (event->binary && !JS_IsException(*data)) {
            event->data = NULL;
        }
        if (JS_IsException(*data) ||
            !esp32_mquickjs_set_property_ref(ctx, object, "data", *data)) {
            JS_PopGCRef(ctx, &data_ref);
            JS_PopGCRef(ctx, &object_ref);
            return false;
        }
        *data = JS_UNDEFINED;
    }
    if ((event->kind == WEBSOCKET_CALLBACK_CLOSE ||
         event->kind == WEBSOCKET_CALLBACK_ERROR) &&
        (!esp32_mquickjs_set_property_ref(ctx, object, "code",
                                          JS_NewInt32(ctx, event->code)) ||
         !esp32_mquickjs_set_property_ref(ctx, object, "message",
                                          JS_NewString(ctx, event->message)))) {
        JS_PopGCRef(ctx, &data_ref);
        JS_PopGCRef(ctx, &object_ref);
        return false;
    }
    JS_PopGCRef(ctx, &data_ref);
    *out_event = JS_PopGCRef(ctx, &object_ref);
    return true;
}

static JSValue websocket_event_to_js(JSContext *ctx,
                                     const void *data,
                                     void *opaque)
{
    esp32_mquickjs_websocket_callback_event_t *event =
        (esp32_mquickjs_websocket_callback_event_t *)data;
    JSValue result = JS_EXCEPTION;

    (void)opaque;
    if (websocket_make_event_object(ctx, event, &result)) {
        websocket_free_callback_event(event);
        return result;
    }
    websocket_free_callback_event(event);
    return JS_EXCEPTION;
}

static void websocket_drop_event(void *data, void *opaque)
{
    (void)opaque;
    websocket_free_callback_event(data);
}

static bool websocket_materialize_callback_event(
    esp32_mquickjs_websocket_callback_event_t *event)
{
    char *owned;
    size_t allocation_size;

    if (event == NULL || event->kind != WEBSOCKET_CALLBACK_MESSAGE) {
        return event != NULL;
    }
    if (event->slot_index == WEBSOCKET_INVALID_SLOT ||
        event->slot_index >= s_websocket_state.receive_capacity ||
        event->data == NULL ||
        event->data_len > s_websocket_state.max_message_bytes) {
        return false;
    }
    allocation_size = event->data_len + (event->binary ? 0U : 1U);
    owned = esp32_mquickjs_memory_payload_alloc(
        allocation_size > 0U ? allocation_size : 1U,
        ESP32_MQUICKJS_MEMORY_EXTERNAL);
    if (owned == NULL) {
        return false;
    }
    if (event->data_len > 0U) {
        memcpy(owned, event->data, event->data_len);
    }
    if (!event->binary) {
        owned[event->data_len] = '\0';
    }
    websocket_release_receive_slot(event->slot_index);
    event->slot_index = WEBSOCKET_INVALID_SLOT;
    event->data = owned;
    return true;
}

static bool websocket_poller(JSContext *ctx,
                             esp32_mquickjs_runtime_t *runtime,
                             void *opaque)
{
    esp32_mquickjs_websocket_callback_event_t event;
    bool handled = false;

    (void)opaque;
    (void)ctx;
    (void)runtime;
    handled = websocket_poll_close();
    if (ctx == NULL || s_websocket_state.queue == NULL) {
        return handled;
    }

    while (xQueueReceive(s_websocket_state.queue, &event, 0) == pdTRUE) {
        if (event.generation != s_websocket_state.generation ||
            s_websocket_state.event_queue == NULL) {
            websocket_free_callback_event(&event);
            continue;
        }
        if (!websocket_materialize_callback_event(&event)) {
            websocket_free_callback_event(&event);
            atomic_fetch_add_explicit(&s_websocket_state.dropped_events, 1,
                                      memory_order_relaxed);
            continue;
        }
        handled = true;
        if (event.kind == WEBSOCKET_CALLBACK_OPEN) {
            s_websocket_state.opened_events++;
        } else if (event.kind == WEBSOCKET_CALLBACK_MESSAGE) {
            s_websocket_state.received_messages++;
        }

