99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/websocket/esp32_mquickjs_websocket.c
        if (!esp32_mquickjs_event_queue_send(s_websocket_state.event_queue, &event)) {
            websocket_free_callback_event(&event);
        }
    }
    return handled;
}

static bool websocket_get_int_option(JSContext *ctx,
                                     JSValue options,
                                     const char *name,
                                     int default_value,
                                     int min_value,
                                     int max_value,
                                     int *out_value)
{
    JSValue value = JS_GetPropertyStr(ctx, options, name);
    int raw_value;

    if (JS_IsUndefined(value)) {
        *out_value = default_value;
        return true;
    }
    if (JS_ToInt32(ctx, &raw_value, value) != 0 ||
        raw_value < min_value || raw_value > max_value) {
        return false;
    }
    *out_value = raw_value;
    return true;
}

bool esp32_mquickjs_init_websocket_runtime(JSContext *ctx,
                                            esp32_mquickjs_runtime_t *runtime)
{
    if (s_websocket_state.initialized) {
        s_websocket_state.runtime = runtime;
        return true;
    }

    websocket_reset_state();
    s_websocket_state.queue = xQueueCreate(
        CONFIG_ESP32_MQUICKJS_WEBSOCKET_EVENT_QUEUE_LEN,
        sizeof(esp32_mquickjs_websocket_callback_event_t));
    if (s_websocket_state.queue == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    s_websocket_state.runtime = runtime;
    if (!esp32_mquickjs_register_async_poller(runtime, websocket_poller, NULL)) {
        vQueueDelete(s_websocket_state.queue);
        websocket_reset_state();
        JS_ThrowInternalError(ctx, "failed to register WebSocket poller");
        return false;
    }
    s_websocket_state.initialized = true;
    if (!websocket_register_future_driver(ctx, runtime)) {
        vQueueDelete(s_websocket_state.queue);
        websocket_reset_state();
        return false;
    }
    return true;
}

bool esp32_mquickjs_deinit_websocket_runtime(JSContext *ctx)
{
    if (!s_websocket_state.initialized) {
        return true;
    }
    websocket_close_internal();
    if (!websocket_wait_for_close()) {
        ESP_LOGE(TAG,
                 "WebSocket runtime cleanup retained for retry: %s",
                 esp_err_to_name((esp_err_t)atomic_load_explicit(
                     &s_websocket_state.close_worker_result,
                     memory_order_acquire)));
        return false;
    }
    if (s_websocket_state.queue != NULL) {
        vQueueDelete(s_websocket_state.queue);
    }
    (void)ctx;
    websocket_reset_state();
    return true;
}

static esp32_mquickjs_websocket_ref_t *websocket_ref_from_value(
    JSContext *ctx, JSValue value, bool require_active)
{
    esp32_mquickjs_websocket_ref_t *ref;
    esp32_mquickjs_websocket_lifecycle_t lifecycle;

    if (JS_GetClassID(ctx, value) != JS_CLASS_WEBSOCKET_CLIENT_HANDLE ||
        (ref = JS_GetOpaque(ctx, value)) == NULL ||
        ref == &s_websocket_closed_ref) {
        JS_ThrowTypeError(ctx, "expected a WebSocketClientHandle");
        return NULL;
    }
    lifecycle = atomic_load_explicit(&s_websocket_state.lifecycle,
                                     memory_order_acquire);
    if (require_active &&
        (ref->generation != s_websocket_state.generation ||
         !websocket_lifecycle_is_active(lifecycle))) {
        JS_ThrowReferenceError(
            ctx, "WEBSOCKET_STALE_HANDLE: client handle is closed");
        return NULL;
    }
    return ref;
}

JSValue js_websocket_handle_constructor(JSContext *ctx, JSValue *this_val,
                                        int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(
        ctx, "WebSocketClientHandle cannot be constructed directly");
}

void js_websocket_handle_finalizer(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_websocket_ref_t *ref = opaque;

    (void)ctx;
    if (ref != NULL && ref != &s_websocket_closed_ref) {
        if (ref->generation == s_websocket_state.generation &&
            websocket_lifecycle_is_active(atomic_load_explicit(
                &s_websocket_state.lifecycle, memory_order_acquire))) {
            esp32_mquickjs_event_queue_request_close(
                s_websocket_state.event_queue);
        }
        heap_caps_free(ref);
    }
}

JSValue js_websocket_receive(JSContext *ctx, JSValue *this_val,
                             int argc, JSValue *argv)
{
    JSGCRef receiver_ref, method_ref;
    JSValue *receiver = JS_PushGCRef(ctx, &receiver_ref);
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;

    if (this_val == NULL ||
        websocket_ref_from_value(ctx, *this_val, true) == NULL) {
        JS_PopGCRef(ctx, &method_ref);
        JS_PopGCRef(ctx, &receiver_ref);
        return JS_EXCEPTION;
    }
    *receiver = *this_val;
    *method = JS_GetPropertyStr(ctx, *receiver, "receive");
    result = JS_IsException(*method)
                 ? JS_EXCEPTION
                 : esp32_mquickjs_future_call_and_wait(
                       ctx, esp32_mquickjs_get_active_runtime(), *method,
                       *receiver, argc, argv);
    JS_PopGCRef(ctx, &method_ref);
    JS_PopGCRef(ctx, &receiver_ref);
    return result;
}

JSValue js_websocket_stats(JSContext *ctx, JSValue *this_val,
                           int argc, JSValue *argv)
{
    if (this_val == NULL ||
        websocket_ref_from_value(ctx, *this_val, true) == NULL) {
        return JS_EXCEPTION;
    }
    return js_event_queue_stats(ctx, this_val, argc, argv);
}

JSValue js_websocket_capabilities(JSContext *ctx, JSValue *this_val,
                                  int argc, JSValue *argv)
{
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);

    (void)this_val;
    (void)argv;
    if (argc != 0) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_ThrowTypeError(
            ctx, "websocketClient.capabilities() expects no arguments");
    }
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "apiVersion",
                                         JS_NewString(ctx, "v1")) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "target",
                                         JS_NewString(ctx, CONFIG_IDF_TARGET)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "idfVersion",
                                         JS_NewString(ctx, IDF_VER)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "supported", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "maxMessageBytes",
            JS_NewUint32(ctx,
                         CONFIG_ESP32_MQUICKJS_WEBSOCKET_MAX_MESSAGE_BYTES)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "nativeReconnect",
                                         JS_FALSE)) {
        *result = JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

JSValue js_websocket_open(JSContext *ctx,
                          JSValue *this_val,
                          int argc,
                          JSValue *argv)
{
    static const char *const allowed[] = {
        "url",
        "authorization",
        "subprotocol",
        "networkTimeoutMs",
        "sendTimeoutMs",
        "pingIntervalSec",
        "maxMessageBytes",
    };
    JSCStringBuf url_buf;
    JSCStringBuf authorization_buf;
    JSCStringBuf subprotocol_buf;
    JSValue url_value;
    JSValue authorization_value;
    JSValue subprotocol_value;
    const char *url;
    const char *authorization = NULL;
    const char *subprotocol = NULL;
    char *url_copy = NULL;
    char *subprotocol_copy = NULL;
    size_t url_len = 0;
    size_t authorization_len = 0;
    size_t subprotocol_len = 0;
    char *headers = NULL;
    int network_timeout_ms;
    int send_timeout_ms;
    int ping_interval_sec;
    int max_message_bytes;
    esp_websocket_client_config_t config = {0};
    esp_websocket_client_handle_t client;
    JSGCRef queue_ref;
    JSGCRef handle_ref;
    JSValue *queue_object;
    JSValue *handle;
    esp32_mquickjs_websocket_ref_t *ref = NULL;
    esp_err_t err;

    if (!s_websocket_state.initialized) {
        return JS_ThrowInternalError(ctx, "websocketClient is not initialized");
    }
    (void)websocket_poll_close();
    if (atomic_load_explicit(&s_websocket_state.lifecycle,
                             memory_order_acquire) !=
            WEBSOCKET_LIFECYCLE_IDLE ||
        s_websocket_state.client != NULL) {
        return JS_ThrowInternalError(ctx, "websocketClient is already open");
    }
    if (argc != 1 || JS_GetClassID(ctx, argv[0]) < 0) {
        return JS_ThrowTypeError(ctx,
                                 "websocketClient.open(options) expects one options object");
    }
    if (!esp32_mquickjs_validate_plain_options(
            ctx, argv[0], "websocketClient.open()", allowed,
            sizeof(allowed) / sizeof(allowed[0]))) {
        return JS_EXCEPTION;
    }

    url_value = JS_GetPropertyStr(ctx, argv[0], "url");
    if (!JS_IsString(ctx, url_value)) {
        return JS_ThrowTypeError(ctx, "websocketClient.open() requires options.url");
    }
    url = JS_ToCStringLen(ctx, &url_len, url_value, &url_buf);
    if (url == NULL || url_len == 0 || url_len > WEBSOCKET_URL_MAX_LEN ||
        (strncmp(url, "ws://", 5) != 0 && strncmp(url, "wss://", 6) != 0)) {
        return JS_ThrowTypeError(ctx, "websocketClient.open() url must use ws:// or wss://");
    }
    url_copy = heap_caps_malloc(url_len + 1U, MALLOC_CAP_8BIT);
    if (url_copy == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }
    memcpy(url_copy, url, url_len);
    url_copy[url_len] = '\0';

