99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/websocket/esp32_mquickjs_websocket.c
    authorization_value = JS_GetPropertyStr(ctx, argv[0], "authorization");
    if (!JS_IsUndefined(authorization_value)) {
        if (!JS_IsString(ctx, authorization_value)) {
            heap_caps_free(url_copy);
            return JS_ThrowTypeError(ctx, "websocketClient.open() authorization must be a string");
        }
        authorization = JS_ToCStringLen(ctx,
                                        &authorization_len,
                                        authorization_value,
                                        &authorization_buf);
        if (authorization == NULL || authorization_len == 0 ||
            authorization_len > WEBSOCKET_AUTHORIZATION_MAX_LEN ||
            memchr(authorization, '\r', authorization_len) != NULL ||
            memchr(authorization, '\n', authorization_len) != NULL) {
            heap_caps_free(url_copy);
            return JS_ThrowTypeError(ctx, "invalid WebSocket authorization header");
        }
        headers = heap_caps_malloc(authorization_len + 18U, MALLOC_CAP_8BIT);
        if (headers == NULL) {
            heap_caps_free(url_copy);
            return JS_ThrowOutOfMemory(ctx);
        }
        snprintf(headers,
                 authorization_len + 18U,
                 "Authorization: %.*s\r\n",
                 (int)authorization_len,
                 authorization);
    }

    subprotocol_value = JS_GetPropertyStr(ctx, argv[0], "subprotocol");
    if (!JS_IsUndefined(subprotocol_value)) {
        if (!JS_IsString(ctx, subprotocol_value)) {
            heap_caps_free(headers);
            heap_caps_free(url_copy);
            return JS_ThrowTypeError(ctx, "websocketClient.open() subprotocol must be a string");
        }
        subprotocol = JS_ToCStringLen(ctx,
                                     &subprotocol_len,
                                     subprotocol_value,
                                     &subprotocol_buf);
        if (subprotocol == NULL || subprotocol_len == 0 ||
            subprotocol_len > WEBSOCKET_SUBPROTOCOL_MAX_LEN) {
            heap_caps_free(headers);
            heap_caps_free(url_copy);
            return JS_ThrowTypeError(ctx, "invalid WebSocket subprotocol");
        }
        subprotocol_copy = heap_caps_malloc(subprotocol_len + 1U, MALLOC_CAP_8BIT);
        if (subprotocol_copy == NULL) {
            heap_caps_free(headers);
            heap_caps_free(url_copy);
            return JS_ThrowOutOfMemory(ctx);
        }
        memcpy(subprotocol_copy, subprotocol, subprotocol_len);
        subprotocol_copy[subprotocol_len] = '\0';
    }

    if (!websocket_get_int_option(ctx, argv[0], "networkTimeoutMs",
                                  WEBSOCKET_DEFAULT_NETWORK_TIMEOUT_MS, 1000, 120000,
                                  &network_timeout_ms) ||
        !websocket_get_int_option(ctx, argv[0], "sendTimeoutMs",
                                  WEBSOCKET_DEFAULT_SEND_TIMEOUT_MS, 0, 5000,
                                  &send_timeout_ms) ||
        !websocket_get_int_option(ctx, argv[0], "pingIntervalSec",
                                  WEBSOCKET_DEFAULT_PING_INTERVAL_SEC, 1, 3600,
                                  &ping_interval_sec) ||
        !websocket_get_int_option(ctx, argv[0], "maxMessageBytes",
                                  CONFIG_ESP32_MQUICKJS_WEBSOCKET_MAX_MESSAGE_BYTES,
                                  256,
                                  CONFIG_ESP32_MQUICKJS_WEBSOCKET_MAX_MESSAGE_BYTES,
                                  &max_message_bytes)) {
        heap_caps_free(subprotocol_copy);
        heap_caps_free(headers);
        heap_caps_free(url_copy);
        return JS_ThrowRangeError(ctx, "invalid websocketClient.open() option");
    }
    if (!esp32_mquickjs_net_is_ready()) {
        heap_caps_free(subprotocol_copy);
        heap_caps_free(headers);
        heap_caps_free(url_copy);
        return JS_ThrowInternalError(
            ctx, "a network interface must be ready before opening WebSocket");
    }

    config.uri = url_copy;
    config.headers = headers;
    config.subprotocol = subprotocol_copy;
    config.user_context = &s_websocket_state;
    config.disable_auto_reconnect = true;
    config.enable_close_reconnect = false;
    config.network_timeout_ms = network_timeout_ms;
    config.ping_interval_sec = (size_t)ping_interval_sec;
    config.task_stack = CONFIG_ESP32_MQUICKJS_WEBSOCKET_TASK_STACK_SIZE;
    config.task_prio = 5;
    config.buffer_size = 1024;
    if (strncmp(url_copy, "wss://", 6) == 0) {
        config.crt_bundle_attach = esp32_mquickjs_tls_crt_bundle_attach;
    }

    if (!websocket_allocate_receive_pool(
            ctx, (size_t)max_message_bytes)) {
        heap_caps_free(subprotocol_copy);
        heap_caps_free(headers);
        heap_caps_free(url_copy);
        return JS_EXCEPTION;
    }

    client = esp_websocket_client_init(&config);
    heap_caps_free(subprotocol_copy);
    heap_caps_free(headers);
    heap_caps_free(url_copy);
    if (client == NULL) {
        websocket_free_receive_pool();
        return JS_ThrowInternalError(ctx, "failed to initialize WebSocket client");
    }

    s_websocket_state.generation++;
    if (s_websocket_state.generation == 0) {
        s_websocket_state.generation++;
    }
    s_websocket_state.client = client;
    s_websocket_state.max_message_bytes = (size_t)max_message_bytes;
    s_websocket_state.send_timeout_ms = (uint32_t)send_timeout_ms;
    queue_object = JS_PushGCRef(ctx, &queue_ref);
    handle = JS_PushGCRef(ctx, &handle_ref);
    *queue_object = esp32_mquickjs_event_queue_new(
        ctx,
        s_websocket_state.runtime,
        sizeof(esp32_mquickjs_websocket_callback_event_t),
        CONFIG_ESP32_MQUICKJS_WEBSOCKET_EVENT_QUEUE_LEN,
        ESP32_MQUICKJS_EVENT_QUEUE_DROP_NEWEST,
        websocket_event_to_js,
        websocket_drop_event,
        websocket_close_source,
        NULL);
    *handle = JS_NewObjectClassUser(ctx, JS_CLASS_WEBSOCKET_CLIENT_HANDLE);
    if (!JS_IsException(*handle)) {
        ref = heap_caps_calloc(1, sizeof(*ref), MALLOC_CAP_8BIT);
        if (ref == NULL) {
            JS_ThrowOutOfMemory(ctx);
            *handle = JS_EXCEPTION;
        } else {
            ref->generation = s_websocket_state.generation;
            JS_SetOpaque(ctx, *handle, ref);
        }
    }
    if (JS_IsException(*queue_object) || JS_IsException(*handle) ||
        !esp32_mquickjs_set_property_ref(ctx, handle, "_eventQueue",
                                         *queue_object)) {
        if (ref != NULL) {
            JS_SetOpaque(ctx, *handle, NULL);
            heap_caps_free(ref);
        }
        websocket_close_source(NULL);
        JS_PopGCRef(ctx, &handle_ref);
        JS_PopGCRef(ctx, &queue_ref);
        return JS_EXCEPTION;
    }
    s_websocket_state.event_queue = JS_GetOpaque(ctx, *queue_object);
    /* Publish the complete generation before ESP-IDF can invoke callbacks. */
    atomic_store_explicit(&s_websocket_state.lifecycle,
                          WEBSOCKET_LIFECYCLE_OPEN,
                          memory_order_release);

    err = esp_websocket_register_events(client,
                                        WEBSOCKET_EVENT_ANY,
                                        websocket_event_handler,
                                        &s_websocket_state);
    if (err == ESP_OK) {
        s_websocket_state.events_registered = true;
        err = esp_websocket_client_start(client);
        if (err == ESP_OK) {
            s_websocket_state.client_started = true;
        }
    }
    if (err != ESP_OK) {
        websocket_close_internal();
        JS_SetOpaque(ctx, *handle, NULL);
        heap_caps_free(ref);
        JS_PopGCRef(ctx, &handle_ref);
        JS_PopGCRef(ctx, &queue_ref);
        return JS_ThrowInternalError(ctx,
                                     "failed to start WebSocket client: %s",
                                     esp_err_to_name(err));
    }
    JS_PopGCRef(ctx, &queue_ref);
    return JS_PopGCRef(ctx, &handle_ref);
}

