99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/websocket/esp32_mquickjs_websocket.c
JSValue js_websocket_close(JSContext *ctx,
                           JSValue *this_val,
                           int argc,
                           JSValue *argv)
{
    esp32_mquickjs_websocket_ref_t *ref;
    esp32_mquickjs_websocket_lifecycle_t lifecycle;
    bool was_open;

    if (this_val == NULL || argc != 0 ||
        JS_GetClassID(ctx, *this_val) != JS_CLASS_WEBSOCKET_CLIENT_HANDLE) {
        return JS_ThrowTypeError(
            ctx, "WebSocketClientHandle.close() expects no arguments");
    }
    (void)argv;
    ref = JS_GetOpaque(ctx, *this_val);
    if (ref == NULL || ref == &s_websocket_closed_ref) return JS_FALSE;
    (void)websocket_poll_close();
    lifecycle = atomic_load_explicit(&s_websocket_state.lifecycle,
                                     memory_order_acquire);
    was_open = ref->generation == s_websocket_state.generation &&
               websocket_lifecycle_is_active(lifecycle);
    if (was_open) websocket_close_internal();
    JS_SetOpaque(ctx, *this_val, &s_websocket_closed_ref);
    heap_caps_free(ref);
    return JS_NewBool(was_open);
}

static bool websocket_copy_send_payload(JSContext *ctx,
                                        JSValue value,
                                        char **out_data,
                                        size_t *out_length,
                                        bool *out_binary)
{
    int class_id = JS_GetClassID(ctx, value);

    *out_data = NULL;
    *out_length = 0;
    *out_binary = !JS_IsString(ctx, value);
    if (JS_IsString(ctx, value)) {
        JSCStringBuf text_buf;
        const char *text;
        size_t length = 0;

        text = JS_ToCStringLen(ctx, &length, value, &text_buf);
        if (text == NULL) {
            return false;
        }
        if (length > s_websocket_state.max_message_bytes ||
            length > INT32_MAX) {
            JS_ThrowRangeError(ctx,
                               "websocketClient.send() message is too large");
            return false;
        }
        *out_data = esp32_mquickjs_memory_payload_alloc(
            length > 0 ? length : 1U, ESP32_MQUICKJS_MEMORY_EXTERNAL);
        if (*out_data == NULL) {
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
        if (length > 0) {
            memcpy(*out_data, text, length);
        }
        *out_length = length;
        return true;
    }
    if (class_id == JS_CLASS_BYTE_SPAN_SOURCE ||
        class_id == JS_CLASS_BITMAP_SPAN_SOURCE) {
        esp32_mquickjs_byte_span_source_t source;
        JSValue error = JS_UNDEFINED;
        size_t capacity = 0;
        size_t length = 0;
        bool opened = false;
        bool ok = false;

        if (!esp32_mquickjs_open_byte_span_source(
                ctx, value, "websocketClient.send(data)", &source, &error)) {
            if (!JS_IsUndefined(error) && !JS_IsException(error)) {
                (void)JS_Throw(ctx, error);
            }
            return false;
        }
        opened = true;
        for (;;) {
            esp32_mquickjs_byte_span_t span;
            size_t required;

            if (!esp32_mquickjs_byte_span_source_next(ctx, &source, &span)) {
                ok = !JS_HasException(ctx);
                break;
            }
            if (span.length == 0) {
                continue;
            }
            if (span.data == NULL ||
                span.length > s_websocket_state.max_message_bytes ||
                length > s_websocket_state.max_message_bytes - span.length) {
                JS_ThrowRangeError(
                    ctx, "websocketClient.send() message is too large");
                break;
            }
            required = length + span.length;
            if (required > capacity) {
                size_t next_capacity = capacity == 0 ? 256U : capacity;
                char *next;

                while (next_capacity < required) {
                    if (next_capacity >=
                        s_websocket_state.max_message_bytes / 2U) {
                        next_capacity = s_websocket_state.max_message_bytes;
                        break;
                    }
                    next_capacity *= 2U;
                }
                next = esp32_mquickjs_memory_payload_realloc(
                    *out_data, next_capacity,
                    ESP32_MQUICKJS_MEMORY_EXTERNAL);
                if (next == NULL) {
                    JS_ThrowOutOfMemory(ctx);
                    break;
                }
                *out_data = next;
                capacity = next_capacity;
            }
            memcpy(*out_data + length, span.data, span.length);
            length = required;
        }
        if (opened) {
            esp32_mquickjs_byte_span_source_close(ctx, &source);
        }
        if (!ok) {
            heap_caps_free(*out_data);
            *out_data = NULL;
            return false;
        }
        if (*out_data == NULL) {
            *out_data = esp32_mquickjs_memory_payload_alloc(
                1U, ESP32_MQUICKJS_MEMORY_EXTERNAL);
            if (*out_data == NULL) {
                JS_ThrowOutOfMemory(ctx);
                return false;
            }
        }
        *out_length = length;
        return true;
    }
    {
        esp32_mquickjs_byte_source_t source;
        uint8_t *owned = NULL;
        JSValue error = JS_UNDEFINED;

        if (!esp32_mquickjs_get_byte_source(
                ctx, value, "websocketClient.send(data)", &source, &owned,
                &error)) {
            if (!JS_IsUndefined(error) && !JS_IsException(error)) {
                (void)JS_Throw(ctx, error);
            }
            return false;
        }
        if (source.length > s_websocket_state.max_message_bytes ||
            source.length > INT32_MAX) {
            esp32_mquickjs_release_byte_source(owned);
            JS_ThrowRangeError(ctx,
                               "websocketClient.send() message is too large");
            return false;
        }
        *out_data = esp32_mquickjs_memory_payload_alloc(
            source.length > 0 ? source.length : 1U,
            ESP32_MQUICKJS_MEMORY_EXTERNAL);
        if (*out_data == NULL) {
            esp32_mquickjs_release_byte_source(owned);
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
        if (source.length > 0) {
            memcpy(*out_data, source.data, source.length);
        }
        *out_length = source.length;
        esp32_mquickjs_release_byte_source(owned);
        return true;
    }
}

JSValue js_websocket_send(JSContext *ctx,
                          JSValue *this_val,
                          int argc,
                          JSValue *argv)
{
    char *data = NULL;
    size_t length = 0;
    bool binary = false;
    int sent;

    if (this_val == NULL ||
        websocket_ref_from_value(ctx, *this_val, true) == NULL || argc != 1) {
        if (JS_HasException(ctx)) return JS_EXCEPTION;
        return JS_ThrowTypeError(
            ctx, "websocketClient.send(data) expects one data argument");
    }
    if (atomic_load_explicit(&s_websocket_state.lifecycle,
                             memory_order_acquire) !=
            WEBSOCKET_LIFECYCLE_CONNECTED ||
        s_websocket_state.client == NULL ||
        !esp_websocket_client_is_connected(s_websocket_state.client)) {
        return JS_ThrowInternalError(ctx, "websocketClient is not connected");
    }
    if (s_websocket_state.sending) {
        return JS_ThrowInternalError(
            ctx, "websocketClient.send() failed because another send is active");
    }
    if (!websocket_copy_send_payload(ctx, argv[0], &data, &length,
                                     &binary)) {
        return JS_EXCEPTION;
    }

