99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/websocket/esp32_mquickjs_websocket.c
    s_websocket_state.sending = true;
    sent = binary
               ? esp_websocket_client_send_bin(
                     s_websocket_state.client, data, (int)length,
                     pdMS_TO_TICKS(s_websocket_state.send_timeout_ms))
               : esp_websocket_client_send_text(
                     s_websocket_state.client, data, (int)length,
                     pdMS_TO_TICKS(s_websocket_state.send_timeout_ms));
    s_websocket_state.sending = false;
    heap_caps_free(data);
    if (s_websocket_state.close_pending) {
        (void)websocket_schedule_close_worker();
    }
    if (sent < 0 || (size_t)sent != length) {
        return JS_ThrowInternalError(ctx, "websocketClient.send() failed");
    }
    s_websocket_state.sent_messages++;
    return JS_NewInt32(ctx, sent);
}

struct esp32_mquickjs_future_driver_state {
    esp_websocket_client_handle_t client;
    char *data;
    size_t length;
    uint32_t generation;
    uint32_t timeout_ms;
    int sent;
    bool binary;
    _Atomic bool worker_completed;
    bool started;
    _Atomic bool cancelled;
};

static void websocket_send_future_release(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) {
        return;
    }
    heap_caps_free(state->data);
    heap_caps_free(state);
}

static bool websocket_send_future_prepare(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;

    if (out_state == NULL || argc != 1 || this_ref == NULL ||
        websocket_ref_from_value(ctx, this_ref->val, true) == NULL) {
        if (JS_HasException(ctx)) return false;
        JS_ThrowTypeError(
            ctx, "websocketClient.send(data) expects one data argument");
        return false;
    }
    if (atomic_load_explicit(&s_websocket_state.lifecycle,
                             memory_order_acquire) !=
            WEBSOCKET_LIFECYCLE_CONNECTED ||
        s_websocket_state.client == NULL ||
        !esp_websocket_client_is_connected(s_websocket_state.client)) {
        JS_ThrowInternalError(ctx, "websocketClient is not connected");
        return false;
    }
    if (s_websocket_state.sending) {
        JS_ThrowInternalError(
            ctx,
            "websocketClient.send() failed because another send is active");
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    atomic_init(&state->worker_completed, false);
    atomic_init(&state->cancelled, false);
    if (!websocket_copy_send_payload(ctx, argv[0].val, &state->data,
                                     &state->length, &state->binary)) {
        websocket_send_future_release(state);
        return false;
    }
    state->client = s_websocket_state.client;
    state->generation = s_websocket_state.generation;
    state->timeout_ms = s_websocket_state.send_timeout_ms;
    state->sent = -1;
    *out_state = state;
    return true;
}

static void websocket_send_future_worker(void *opaque)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;

    if (state == NULL) {
        return;
    }
    if (!atomic_load_explicit(&state->cancelled, memory_order_acquire)) {
        state->sent = state->binary
                          ? esp_websocket_client_send_bin(
                                state->client, state->data,
                                (int)state->length,
                                pdMS_TO_TICKS(state->timeout_ms))
                          : esp_websocket_client_send_text(
                                state->client, state->data,
                                (int)state->length,
                                pdMS_TO_TICKS(state->timeout_ms));
    }
    atomic_store_explicit(
        &state->worker_completed, true, memory_order_release);
}

static bool websocket_send_future_start(
    JSContext *ctx,
    esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || s_websocket_state.sending ||
        atomic_load_explicit(&s_websocket_state.lifecycle,
                             memory_order_acquire) !=
            WEBSOCKET_LIFECYCLE_CONNECTED ||
        state->client != s_websocket_state.client ||
        state->generation != s_websocket_state.generation) {
        JS_ThrowInternalError(
            ctx, "websocketClient changed before send started");
        return false;
    }
    state->started = true;
    s_websocket_state.sending = true;
    if (!esp32_mquickjs_future_submit_worker(
            runtime, token, websocket_send_future_worker, state)) {
        s_websocket_state.sending = false;
        JS_ThrowInternalError(
            ctx, "websocketClient.send() worker queue is full");
        return false;
    }
    return true;
}

static esp32_mquickjs_future_poll_t websocket_send_future_poll(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state != NULL && atomic_load_explicit(
                             &state->worker_completed, memory_order_acquire)) {
        return ESP32_MQUICKJS_FUTURE_READY;
    }
    return ESP32_MQUICKJS_FUTURE_PENDING;
}

static JSValue websocket_send_future_finish(
    JSContext *ctx,
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL ||
        atomic_load_explicit(&state->cancelled, memory_order_acquire)) {
        return JS_ThrowInternalError(
            ctx, "websocketClient.send() was cancelled");
    }
    if (state->generation != s_websocket_state.generation ||
        state->sent < 0 || (size_t)state->sent != state->length) {
        return JS_ThrowInternalError(ctx, "websocketClient.send() failed");
    }
    s_websocket_state.sent_messages++;
    return JS_NewInt32(ctx, state->sent);
}

static esp32_mquickjs_cancel_result_t websocket_send_future_cancel(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL ||
        atomic_load_explicit(&state->worker_completed, memory_order_acquire) ||
        atomic_load_explicit(&state->cancelled, memory_order_acquire)) {
        return ESP32_MQUICKJS_CANCEL_REJECTED;
    }
    atomic_store_explicit(&state->cancelled, true, memory_order_release);
    return ESP32_MQUICKJS_CANCEL_REQUESTED;
}

static void websocket_send_future_destroy(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state != NULL && state->started) {
        s_websocket_state.sending = false;
        if (s_websocket_state.close_pending) {
            (void)websocket_schedule_close_worker();
        }
    }
    websocket_send_future_release(state);
}

static uint32_t websocket_send_future_timeout_ms(
    const esp32_mquickjs_future_driver_state_t *state)
{
    return state != NULL && state->timeout_ms < UINT32_MAX - 1000U
               ? state->timeout_ms + 1000U
               : 0;
}

static const esp32_mquickjs_future_driver_t s_websocket_send_driver = {
    .capture = websocket_send_future_prepare,
    .start = websocket_send_future_start,
    .poll = websocket_send_future_poll,
    .finish = websocket_send_future_finish,
    .cancel = websocket_send_future_cancel,
    .destroy = websocket_send_future_destroy,
    .timeout_ms = websocket_send_future_timeout_ms,
};

static bool websocket_register_future_driver(
    JSContext *ctx,
    esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef global_ref;
    JSGCRef handle_ref;
    JSGCRef send_ref;
    JSGCRef receive_ref;
    JSValue *global = JS_PushGCRef(ctx, &global_ref);
    JSValue *handle = JS_PushGCRef(ctx, &handle_ref);
    JSValue *send = JS_PushGCRef(ctx, &send_ref);
    JSValue *receive = JS_PushGCRef(ctx, &receive_ref);
    bool registered;

    *global = JS_GetGlobalObject(ctx);
    *handle = JS_IsException(*global)
                  ? JS_EXCEPTION
                  : JS_NewObjectClassUser(
                        ctx, JS_CLASS_WEBSOCKET_CLIENT_HANDLE);
    *send = JS_IsException(*handle)
                ? JS_EXCEPTION
                : JS_GetPropertyStr(ctx, *handle, "send");
    *receive = JS_IsException(*handle)
                   ? JS_EXCEPTION
                   : JS_GetPropertyStr(ctx, *handle, "receive");
    registered = !JS_IsException(*send) &&
                 esp32_mquickjs_future_register_driver(
                     ctx, runtime, *send, &s_websocket_send_driver) &&
                 !JS_IsException(*receive) &&
                 esp32_mquickjs_event_queue_register_receive_alias(
                     ctx, runtime, *receive);
    if (!registered && !JS_HasException(ctx)) {
        JS_ThrowInternalError(
            ctx, "failed to register WebSocket Future driver");
    }
    JS_PopGCRef(ctx, &receive_ref);
    JS_PopGCRef(ctx, &send_ref);
    JS_PopGCRef(ctx, &handle_ref);
    JS_PopGCRef(ctx, &global_ref);
    return registered;
}

