99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/websocket/esp32_mquickjs_websocket.c
JSValue js_websocket_status(JSContext *ctx,
                            JSValue *this_val,
                            int argc,
                            JSValue *argv)
{
    JSGCRef status_ref;
    JSValue *status;
    esp32_mquickjs_websocket_lifecycle_t lifecycle;

    if (this_val == NULL || argc != 0 ||
        websocket_ref_from_value(ctx, *this_val, true) == NULL) {
        if (JS_HasException(ctx)) return JS_EXCEPTION;
        return JS_ThrowTypeError(
            ctx, "WebSocketClientHandle.status() expects no arguments");
    }
    (void)argv;
    (void)websocket_poll_close();
    lifecycle = atomic_load_explicit(&s_websocket_state.lifecycle,
                                     memory_order_acquire);
    status = JS_PushGCRef(ctx, &status_ref);
    *status = JS_NewObject(ctx);
    if (JS_IsException(*status) ||
        !esp32_mquickjs_set_property_ref(ctx, status, "open",
                                         JS_NewBool(
                                             websocket_lifecycle_is_active(
                                                 lifecycle))) ||
        !esp32_mquickjs_set_property_ref(ctx, status, "connected",
                                         JS_NewBool(
                                             lifecycle ==
                                             WEBSOCKET_LIFECYCLE_CONNECTED)) ||
        !esp32_mquickjs_set_property_ref(ctx, status, "closing",
                                         JS_NewBool(
                                             lifecycle ==
                                             WEBSOCKET_LIFECYCLE_CLOSING)) ||
        !esp32_mquickjs_set_property_ref(ctx, status, "maxMessageBytes",
                                         JS_NewInt32(ctx, (int32_t)s_websocket_state.max_message_bytes)) ||
        !esp32_mquickjs_set_property_ref(ctx, status, "openedEvents",
                                         JS_NewInt32(ctx, (int32_t)s_websocket_state.opened_events)) ||
        !esp32_mquickjs_set_property_ref(ctx, status, "receivedMessages",
                                         JS_NewInt32(ctx, (int32_t)s_websocket_state.received_messages)) ||
        !esp32_mquickjs_set_property_ref(ctx, status, "sentMessages",
                                         JS_NewInt32(ctx, (int32_t)s_websocket_state.sent_messages)) ||
        !esp32_mquickjs_set_property_ref(ctx, status, "droppedEvents",
                                         JS_NewUint32(
                                             ctx, atomic_load_explicit(
                                                      &s_websocket_state.dropped_events,
                                                      memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(ctx, status, "oversizedMessages",
                                         JS_NewUint32(
                                             ctx, atomic_load_explicit(
                                                      &s_websocket_state.oversized_messages,
                                                      memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(ctx, status, "queueDroppedEvents",
                                         JS_NewUint32(ctx,
                                             esp32_mquickjs_event_queue_dropped(
                                                 s_websocket_state.event_queue)))) {
        JS_PopGCRef(ctx, &status_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &status_ref);
}

#endif
